# Import Libraries

In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
import csv
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
from sklearn import preprocessing
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import accuracy_score, log_loss, confusion_matrix
from sklearn.preprocessing import MinMaxScaler
from sklearn.metrics import r2_score

# Dataset

In [4]:
allen = pd.read_csv("Dataset.csv")

In [5]:
allen.head()

,Name,Party,Constituency,State,Age,Gender,Prev_Contested,Prev_Wins,Assets,Cases,Prev_Party
0,OMALLOOR RAMACHANDRAN,Ambedkarite Party of India,ARANMULA,KERALA,53,M,0,0,195000,0,0
1,SANTHI OMALLOOR,Anna Democratic Human Rights Movement Party of...,ARANMULA,KERALA,36,F,0,0,50000,0,0
2,BIJU MATHEW,Bharatiya Janata Party,ARANMULA,KERALA,46,M,0,0,16905842,3,0
3,VEENA GEORGE,Communist Party of India (Marxist),ARANMULA,KERALA,44,F,1,1,21717808,0,2
4,K. SIVADASAN NAIR,Indian National Congress,ARANMULA,KERALA,72,M,2,1,9212961,1,6

In [6]:
allen.describe()

,Age,Prev_Contested,Prev_Wins,Assets,Cases,Prev_Party
count,9.000000,9.000000,9.000000,9.000000e+00,9.000000,9.000000
mean,52.333333,0.444444,0.222222,9.649177e+06,0.555556,1.777778
std,12.196311,0.726483,0.440959,9.141307e+06,1.013794,1.855921
min,36.000000,0.000000,0.000000,5.000000e+04,0.000000,0.000000
25%,44.000000,0.000000,0.000000,2.900000e+05,0.000000,0.000000
50%,52.000000,0.000000,0.000000,8.540864e+06,0.000000,2.000000
75%,63.000000,1.000000,0.000000,1.690584e+07,1.000000,2.000000
max,72.000000,2.000000,1.000000,2.342500e+07,3.000000,6.000000

In [7]:
allen.info

<bound method DataFrame.info of                     Name                                              Party  \
0  OMALLOOR RAMACHANDRAN                         Ambedkarite Party of India
1        SANTHI OMALLOOR  Anna Democratic Human Rights Movement Party of...
2            BIJU MATHEW                             Bharatiya Janata Party
3           VEENA GEORGE                 Communist Party of India (Marxist)
4      K. SIVADASAN NAIR                           Indian National Congress
5           ARJUNAN C. K                                        Independent
6            G. SUGATHAN                                        Independent
7      PRASANTH ARANMULA                                        Independent
8         SIVADASAN NAIR                                        Independent

  Constituency   State  Age Gender  Prev_Contested  Prev_Wins    Assets  \
0     ARANMULA  KERALA   53      M               0          0    195000
1     ARANMULA  KERALA   36      F               0          0     50000
2     ARANMULA  KERALA   46      M               0          0  16905842
3     ARANMULA  KERALA   44      F               1          1  21717808
4     ARANMULA  KERALA   72      M               2          1   9212961
5     ARANMULA  KERALA   52      M               0          0    290000
6     ARANMULA  KERALA   65      M               1          0  23425000
7     ARANMULA  KERALA   40      M               0          0   6505120
8     ARANMULA  KERALA   63      M               0          0   8540864

   Cases  Prev_Party
0      0           0
1      0           0
2      3           0
3      0           2
4      1           6
5      0           2
6      1           2
7      0           2
8      0           2  >

# Dataset.csv - Label Encoding

### Party

In [8]:
l1 = preprocessing.LabelEncoder()
f1 = l1.fit_transform(allen['Party']) 
f1 = pd.DataFrame(data=f1, columns=['Party'])

### Gender

In [9]:
l2 = preprocessing.LabelEncoder()
f2 = l2.fit_transform(allen['Gender']) 
f2 = pd.DataFrame(data=f2, columns=['Gender'])

### Constituency

In [11]:
l3 = preprocessing.LabelEncoder()
f3 = l3.fit_transform(allen['Constituency']) 
f3 = pd.DataFrame(data=f3, columns=['Constituency'])

### State

In [12]:
l4 = preprocessing.LabelEncoder()
f4 = l4.fit_transform(allen['State']) 
f4 = pd.DataFrame(data=f4, columns=['State'])

### Updation

In [13]:
allen['Party'] = f1['Party']
allen['Gender'] = f2['Gender']
allen['Constituency'] = f3['Constituency']
allen['State'] = f4['State']

# Dataset.csv - MinMaxScaler

In [673]:
ms = MinMaxScaler()
columns = ['Age ','no of experience in years']
allen1[columns] = ms.fit_transform(allen1[columns])

In [674]:
allen1.head()

,S.No,company,Age,Gender,Qualification,no of experience in years,Area of work,salary package per month
0,1,0,0.000000,1,0,0.000000,3,30000
1,2,0,0.136364,0,1,0.047619,2,50000
2,3,0,0.409091,1,1,0.238095,1,120000
3,4,0,0.090909,1,0,0.095238,3,42000
4,5,0,0.000000,0,0,0.000000,2,35000

# Dataset.csv - Index

In [675]:
print(list(l1.inverse_transform([0,1,2,3,4,5,6,7])))

['ABBB', 'Bashh', 'Link', 'Oxon', 'TSC', 'neuromorphic', 'palm', 'penguin ']

In [676]:
print(list(l2.inverse_transform([0,1,2,3])))

['Predective analysis', 'cloud server management', 'predective analysis', 'programming ']

In [677]:
print(list(l3.inverse_transform([0,1])))

['F', 'M']

In [678]:
print(list(l4.inverse_transform([0,1])))

['B.E', 'M.E']

# Training

In [679]:
x = allen1.drop(['S.No','salary package per month'],axis=1)
x.head()

,company,Age,Gender,Qualification,no of experience in years,Area of work
0,0,0.000000,1,0,0.000000,3
1,0,0.136364,0,1,0.047619,2
2,0,0.409091,1,1,0.238095,1
3,0,0.090909,1,0,0.095238,3
4,0,0.000000,0,0,0.000000,2

In [680]:
y = allen1['salary package per month']

In [681]:
xtrain, xtest, ytrain, ytest = train_test_split(x,y,test_size=0.48,random_state=1)

In [682]:
model = LinearRegression()
model.fit(xtrain,ytrain)
p = model.predict(xtest)
print(r2_score(ytest, p))

0.8081462969225229

# Test.csv - Creation

### Assignment Q1

In [683]:
companies = list(l1.inverse_transform([0,1,2,3,4,5,6,7]))

In [684]:
allen2 = 0
allen2 = pd.DataFrame(columns=['company','Age ','Gender','Qualification','no of experience in years','Area of work'])

In [685]:
for i in range(0,len(companies)):
    init = {"company": companies[i], 
            "Age ": 35,
            "Gender": "F",
            "Qualification": "B.E",
            "no of experience in years": 12,
            "Area of work": "cloud server management"
    }
    allen2 = allen2.append(init, ignore_index=True)

In [686]:
print(allen2.to_string())

        company Age  Gender Qualification no of experience in years             Area of work
0          ABBB   35      F           B.E                        12  cloud server management
1         Bashh   35      F           B.E                        12  cloud server management
2          Link   35      F           B.E                        12  cloud server management
3          Oxon   35      F           B.E                        12  cloud server management
4           TSC   35      F           B.E                        12  cloud server management
5  neuromorphic   35      F           B.E                        12  cloud server management
6          palm   35      F           B.E                        12  cloud server management
7      penguin    35      F           B.E                        12  cloud server management

# Test.csv - Label Encoding

### Company

In [687]:
l5 = preprocessing.LabelEncoder()
f5 = l5.fit_transform(allen2['company']) 
f5 = pd.DataFrame(data=f5, columns=['company'])

### Area

In [688]:
l6 = preprocessing.LabelEncoder()
f6 = l6.fit_transform(allen2['Area of work']) 
f6 = pd.DataFrame(data=f6, columns=['Area of work'])

### Gender

In [689]:
l7 = preprocessing.LabelEncoder()
f7 = l7.fit_transform(allen2['Gender']) 
f7 = pd.DataFrame(data=f7, columns=['Gender'])

### Qualification

In [690]:
l8 = preprocessing.LabelEncoder()
f8 = l8.fit_transform(allen2['Qualification']) 
f8 = pd.DataFrame(data=f8, columns=['Qualification'])

### Updation

In [691]:
allen2['company'] = f5['company']
allen2['Area of work'] = f6['Area of work']
allen2['Gender'] = f7['Gender']
allen2['Qualification'] = f8['Qualification']

# Test.csv - MinMaxScaler

In [692]:
ms = MinMaxScaler()
columns = ['Age ','no of experience in years']
allen2[columns] = ms.fit_transform(allen2[columns])

# Test.csv - Prediction

In [693]:
allen2.head(8)

,company,Age,Gender,Qualification,no of experience in years,Area of work
0,0,0.0,0,0,0.0,0
1,1,0.0,0,0,0.0,0
2,2,0.0,0,0,0.0,0
3,3,0.0,0,0,0.0,0
4,4,0.0,0,0,0.0,0
5,5,0.0,0,0,0.0,0
6,6,0.0,0,0,0.0,0
7,7,0.0,0,0,0.0,0

In [694]:
p2 = model.predict(allen2)

In [695]:
allen2['salary'] = p2
allen2.head(8)

,company,Age,Gender,Qualification,no of experience in years,Area of work,salary
0,0,0.0,0,0,0.0,0,69879.291815
1,1,0.0,0,0,0.0,0,63828.111187
2,2,0.0,0,0,0.0,0,57776.930560
3,3,0.0,0,0,0.0,0,51725.749932
4,4,0.0,0,0,0.0,0,45674.569305
5,5,0.0,0,0,0.0,0,39623.388678
6,6,0.0,0,0,0.0,0,33572.208050
7,7,0.0,0,0,0.0,0,27521.027423

# Test.csv - Index

In [696]:
print(l5.inverse_transform(f5['company']))
allen2['company'] = l5.inverse_transform(f5['company'])

['ABBB' 'Bashh' 'Link' 'Oxon' 'TSC' 'neuromorphic' 'palm' 'penguin ']

In [697]:
print(l6.inverse_transform(f6['Area of work']))
allen2['Area of work'] = l6.inverse_transform(f6['Area of work'])

['cloud server management' 'cloud server management'
 'cloud server management' 'cloud server management'
 'cloud server management' 'cloud server management'
 'cloud server management' 'cloud server management']

In [698]:
print(l7.inverse_transform(f7['Gender']))
allen2['Gender'] = l7.inverse_transform(f7['Gender'])

['F' 'F' 'F' 'F' 'F' 'F' 'F' 'F']

In [699]:
print(l8.inverse_transform(f8['Qualification']))
allen2['Qualification'] = l8.inverse_transform(f8['Qualification'])

['B.E' 'B.E' 'B.E' 'B.E' 'B.E' 'B.E' 'B.E' 'B.E']

In [700]:
print(ms.inverse_transform(allen2[columns]))
allen2[columns] = ms.inverse_transform(allen2[columns])

[[35. 12.]
 [35. 12.]
 [35. 12.]
 [35. 12.]
 [35. 12.]
 [35. 12.]
 [35. 12.]
 [35. 12.]]

In [701]:
allen2.head(8)

,company,Age,Gender,Qualification,no of experience in years,Area of work,salary
0,ABBB,35.0,F,B.E,12.0,cloud server management,69879.291815
1,Bashh,35.0,F,B.E,12.0,cloud server management,63828.111187
2,Link,35.0,F,B.E,12.0,cloud server management,57776.930560
3,Oxon,35.0,F,B.E,12.0,cloud server management,51725.749932
4,TSC,35.0,F,B.E,12.0,cloud server management,45674.569305
5,neuromorphic,35.0,F,B.E,12.0,cloud server management,39623.388678
6,palm,35.0,F,B.E,12.0,cloud server management,33572.208050
7,penguin,35.0,F,B.E,12.0,cloud server management,27521.027423

# Test.csv - Save

In [702]:
allen2.to_csv('Test.csv')

# Validation.csv - Creation

### Assignment Q2

In [703]:
allen3 = pd.read_csv("Dataset2.csv")
allen4 = pd.read_csv("Dataset2.csv")
allen3.head(8)

,S.No,person,Age,Gender,Qualification,no of experience in years,Area of work,salary package per month
0,NaN,Bobby,22,F,B.E,1,programming,NaN
1,NaN,Rahul,28,M,B.E,5,predictive analysis,NaN
2,NaN,Jhanvi,30,F,M.E,4,cloud server management,NaN
3,NaN,Sanjay,35,M,M.E,9,predictive analysis,NaN
4,NaN,sukruti,29,F,M.E,5,cloud server management,NaN
5,NaN,prachi,27,F,B.E,5,predictive analysis,NaN
6,NaN,Nazim,26,M,B.E,5,cloud server management,NaN
7,NaN,Maithri,24,F,M.E,1,cloud server management,NaN

In [704]:
allen3["company"] = companies[0]
for i in range(1,len(companies)):
    allen4["company"] = companies[i]
    allen3 = pd.concat([allen3, allen4], ignore_index = True)
allen3.head(64)

,S.No,person,Age,Gender,Qualification,no of experience in years,Area of work,salary package per month,company
0,NaN,Bobby,22,F,B.E,1,programming,NaN,ABBB
1,NaN,Rahul,28,M,B.E,5,predictive analysis,NaN,ABBB
2,NaN,Jhanvi,30,F,M.E,4,cloud server management,NaN,ABBB
3,NaN,Sanjay,35,M,M.E,9,predictive analysis,NaN,ABBB
4,NaN,sukruti,29,F,M.E,5,cloud server management,NaN,ABBB
...,...,...,...,...,...,...,...,...,...
59,NaN,Sanjay,35,M,M.E,9,predictive analysis,NaN,penguin
60,NaN,sukruti,29,F,M.E,5,cloud server management,NaN,penguin
61,NaN,prachi,27,F,B.E,5,predictive analysis,NaN,penguin
62,NaN,Nazim,26,M,B.E,5,cloud server management,NaN,penguin
63,NaN,Maithri,24,F,M.E,1,cloud server management,NaN,penguin

# Validation.csv - Label Encoding

### Company

In [705]:
l9 = preprocessing.LabelEncoder()
f9 = l9.fit_transform(allen3['company']) 
f9 = pd.DataFrame(data=f9, columns=['company'])

### Area

In [706]:
l10 = preprocessing.LabelEncoder()
f10 = l10.fit_transform(allen3['Area of work']) 
f10 = pd.DataFrame(data=f10, columns=['Area of work'])

### Gender

In [707]:
l11 = preprocessing.LabelEncoder()
f11 = l11.fit_transform(allen3['Gender']) 
f11 = pd.DataFrame(data=f11, columns=['Gender'])

### Qualification

In [708]:
l12 = preprocessing.LabelEncoder()
f12 = l12.fit_transform(allen3['Qualification']) 
f12 = pd.DataFrame(data=f12, columns=['Qualification'])

### Updation

In [709]:
allen3['company'] = f9['company']
allen3['Area of work'] = f10['Area of work']
allen3['Gender'] = f11['Gender']
allen3['Qualification'] = f12['Qualification']

# Validation.csv - MinMaxScaler

In [710]:
ms = MinMaxScaler()
columns = ['Age ','no of experience in years']
allen3[columns] = ms.fit_transform(allen3[columns])

# Validation.csv - Prediction

In [711]:
allen3 = allen3.drop(['S.No','person','salary package per month'],axis=1)
allen3 = allen3[['company','Age ','Gender','Qualification','no of experience in years','Area of work']]
allen3.head(64)

,company,Age,Gender,Qualification,no of experience in years,Area of work
0,0,0.000000,0,0,0.000,2
1,0,0.461538,1,0,0.500,1
2,0,0.615385,0,1,0.375,0
3,0,1.000000,1,1,1.000,1
4,0,0.538462,0,1,0.500,0
...,...,...,...,...,...,...
59,7,1.000000,1,1,1.000,1
60,7,0.538462,0,1,0.500,0
61,7,0.384615,0,0,0.500,1
62,7,0.307692,1,0,0.500,0
63,7,0.153846,0,1,0.000,0

In [712]:
p3 = model.predict(allen3)

In [713]:
allen3['salary'] = p3
allen3.head(64)

,company,Age,Gender,Qualification,no of experience in years,Area of work,salary
0,0,0.000000,0,0,0.000,2,54824.880146
1,0,0.461538,1,0,0.500,1,208400.793430
2,0,0.615385,0,1,0.375,0,145345.375236
3,0,1.000000,1,1,1.000,1,352574.982362
4,0,0.538462,0,1,0.500,0,214053.480747
...,...,...,...,...,...,...,...
59,7,1.000000,1,1,1.000,1,310216.717970
60,7,0.538462,0,1,0.500,0,171695.216355
61,7,0.384615,0,0,0.500,1,185702.464296
62,7,0.307692,1,0,0.500,0,197819.463614
63,7,0.153846,0,1,0.000,0,5986.573648

In [714]:
print(allen3.to_string())

    company      Age   Gender  Qualification  no of experience in years  Area of work         salary
0         0  0.000000       0              0                      0.000             2   54824.880146
1         0  0.461538       1              0                      0.500             1  208400.793430
2         0  0.615385       0              1                      0.375             0  145345.375236
3         0  1.000000       1              1                      1.000             1  352574.982362
4         0  0.538462       0              1                      0.500             0  214053.480747
5         0  0.384615       0              0                      0.500             1  228060.728687
6         0  0.307692       1              0                      0.500             0  240177.728006
7         0  0.153846       0              1                      0.000             0   48344.838040
8         1  0.000000       0              0                      0.000             2   48773.699519
9         1  0.461538       1              0                      0.500             1  202349.612803
10        1  0.615385       0              1                      0.375             0  139294.194608
11        1  1.000000       1              1                      1.000             1  346523.801735
12        1  0.538462       0              1                      0.500             0  208002.300120
13        1  0.384615       0              0                      0.500             1  222009.548060
14        1  0.307692       1              0                      0.500             0  234126.547378
15        1  0.153846       0              1                      0.000             0   42293.657413
16        2  0.000000       0              0                      0.000             2   42722.518892
17        2  0.461538       1              0                      0.500             1  196298.432175
18        2  0.615385       0              1                      0.375             0  133243.013981
19        2  1.000000       1              1                      1.000             1  340472.621108
20        2  0.538462       0              1                      0.500             0  201951.119492
21        2  0.384615       0              0                      0.500             1  215958.367433
22        2  0.307692       1              0                      0.500             0  228075.366751
23        2  0.153846       0              1                      0.000             0   36242.476785
24        3  0.000000       0              0                      0.000             2   36671.338264
25        3  0.461538       1              0                      0.500             1  190247.251548
26        3  0.615385       0              1                      0.375             0  127191.833354
27        3  1.000000       1              1                      1.000             1  334421.440480
28        3  0.538462       0              1                      0.500             0  195899.938865
29        3  0.384615       0              0                      0.500             1  209907.186805
30        3  0.307692       1              0                      0.500             0  222024.186124
31        3  0.153846       0              1                      0.000             0   30191.296158
32        4  0.000000       0              0                      0.000             2   30620.157637
33        4  0.461538       1              0                      0.500             1  184196.070920
34        4  0.615385       0              1                      0.375             0  121140.652726
35        4  1.000000       1              1                      1.000             1  328370.259853
36        4  0.538462       0              1                      0.500             0  189848.758237
37        4  0.384615       0              0                      0.500             1  203856.006178
38        4  0.307692       1              0                      0.500             0  215973.005496
39        4  0.153846       0              1                      0.000             0   24140.115530
40        5  0.000000       0              0                      0.000             2   24568.977009
41        5  0.461538       1              0                      0.500             1  178144.890293
42        5  0.615385       0              1                      0.375             0  115089.472099
43        5  1.000000       1              1                      1.000             1  322319.079225
44        5  0.538462       0              1                      0.500             0  183797.577610
45        5  0.384615       0              0                      0.500             1  197804.825550
46        5  0.307692       1              0                      0.500             0  209921.824869
47        5  0.153846       0              1                      0.000             0   18088.934903
48        6  0.000000       0              0                      0.000             2   18517.796382
49        6  0.461538       1              0                      0.500             1  172093.709666
50        6  0.615385       0              1                      0.375             0  109038.291471
51        6  1.000000       1              1                      1.000             1  316267.898598
52        6  0.538462       0              1                      0.500             0  177746.396982
53        6  0.384615       0              0                      0.500             1  191753.644923
54        6  0.307692       1              0                      0.500             0  203870.644241
55        6  0.153846       0              1                      0.000             0   12037.754276
56        7  0.000000       0              0                      0.000             2   12466.615754
57        7  0.461538       1              0                      0.500             1  166042.529038
58        7  0.615385       0              1                      0.375             0  102987.110844
59        7  1.000000       1              1                      1.000             1  310216.717970
60        7  0.538462       0              1                      0.500             0  171695.216355
61        7  0.384615       0              0                      0.500             1  185702.464296
62        7  0.307692       1              0                      0.500             0  197819.463614
63        7  0.153846       0              1                      0.000             0    5986.573648

# Validation.csv - Index

In [715]:
allen3['company'] = l9.inverse_transform(f9['company'])

In [716]:
allen3['Area of work'] = l10.inverse_transform(f10['Area of work'])

In [717]:
allen3['Gender'] = l11.inverse_transform(f11['Gender'])

In [718]:
allen3['Qualification'] = l12.inverse_transform(f12['Qualification'])

In [719]:
allen3[columns] = ms.inverse_transform(allen3[columns])

In [720]:
allen3.head(64)

,company,Age,Gender,Qualification,no of experience in years,Area of work,salary
0,ABBB,22.0,F,B.E,1.0,programming,54824.880146
1,ABBB,28.0,M,B.E,5.0,predictive analysis,208400.793430
2,ABBB,30.0,F,M.E,4.0,cloud server management,145345.375236
3,ABBB,35.0,M,M.E,9.0,predictive analysis,352574.982362
4,ABBB,29.0,F,M.E,5.0,cloud server management,214053.480747
...,...,...,...,...,...,...,...
59,penguin,35.0,M,M.E,9.0,predictive analysis,310216.717970
60,penguin,29.0,F,M.E,5.0,cloud server management,171695.216355
61,penguin,27.0,F,B.E,5.0,predictive analysis,185702.464296
62,penguin,26.0,M,B.E,5.0,cloud server management,197819.463614
63,penguin,24.0,F,M.E,1.0,cloud server management,5986.573648

In [721]:
print(allen3.to_string())

         company  Age  Gender Qualification  no of experience in years             Area of work         salary
0           ABBB  22.0      F           B.E                        1.0              programming   54824.880146
1           ABBB  28.0      M           B.E                        5.0      predictive analysis  208400.793430
2           ABBB  30.0      F           M.E                        4.0  cloud server management  145345.375236
3           ABBB  35.0      M           M.E                        9.0      predictive analysis  352574.982362
4           ABBB  29.0      F           M.E                        5.0  cloud server management  214053.480747
5           ABBB  27.0      F           B.E                        5.0      predictive analysis  228060.728687
6           ABBB  26.0      M           B.E                        5.0  cloud server management  240177.728006
7           ABBB  24.0      F           M.E                        1.0  cloud server management   48344.838040
8          Bashh  22.0      F           B.E                        1.0              programming   48773.699519
9          Bashh  28.0      M           B.E                        5.0      predictive analysis  202349.612803
10         Bashh  30.0      F           M.E                        4.0  cloud server management  139294.194608
11         Bashh  35.0      M           M.E                        9.0      predictive analysis  346523.801735
12         Bashh  29.0      F           M.E                        5.0  cloud server management  208002.300120
13         Bashh  27.0      F           B.E                        5.0      predictive analysis  222009.548060
14         Bashh  26.0      M           B.E                        5.0  cloud server management  234126.547378
15         Bashh  24.0      F           M.E                        1.0  cloud server management   42293.657413
16          Link  22.0      F           B.E                        1.0              programming   42722.518892
17          Link  28.0      M           B.E                        5.0      predictive analysis  196298.432175
18          Link  30.0      F           M.E                        4.0  cloud server management  133243.013981
19          Link  35.0      M           M.E                        9.0      predictive analysis  340472.621108
20          Link  29.0      F           M.E                        5.0  cloud server management  201951.119492
21          Link  27.0      F           B.E                        5.0      predictive analysis  215958.367433
22          Link  26.0      M           B.E                        5.0  cloud server management  228075.366751
23          Link  24.0      F           M.E                        1.0  cloud server management   36242.476785
24          Oxon  22.0      F           B.E                        1.0              programming   36671.338264
25          Oxon  28.0      M           B.E                        5.0      predictive analysis  190247.251548
26          Oxon  30.0      F           M.E                        4.0  cloud server management  127191.833354
27          Oxon  35.0      M           M.E                        9.0      predictive analysis  334421.440480
28          Oxon  29.0      F           M.E                        5.0  cloud server management  195899.938865
29          Oxon  27.0      F           B.E                        5.0      predictive analysis  209907.186805
30          Oxon  26.0      M           B.E                        5.0  cloud server management  222024.186124
31          Oxon  24.0      F           M.E                        1.0  cloud server management   30191.296158
32           TSC  22.0      F           B.E                        1.0              programming   30620.157637
33           TSC  28.0      M           B.E                        5.0      predictive analysis  184196.070920
34           TSC  30.0      F           M.E                        4.0  cloud server management  121140.652726
35           TSC  35.0      M           M.E                        9.0      predictive analysis  328370.259853
36           TSC  29.0      F           M.E                        5.0  cloud server management  189848.758237
37           TSC  27.0      F           B.E                        5.0      predictive analysis  203856.006178
38           TSC  26.0      M           B.E                        5.0  cloud server management  215973.005496
39           TSC  24.0      F           M.E                        1.0  cloud server management   24140.115530
40  neuromorphic  22.0      F           B.E                        1.0              programming   24568.977009
41  neuromorphic  28.0      M           B.E                        5.0      predictive analysis  178144.890293
42  neuromorphic  30.0      F           M.E                        4.0  cloud server management  115089.472099
43  neuromorphic  35.0      M           M.E                        9.0      predictive analysis  322319.079225
44  neuromorphic  29.0      F           M.E                        5.0  cloud server management  183797.577610
45  neuromorphic  27.0      F           B.E                        5.0      predictive analysis  197804.825550
46  neuromorphic  26.0      M           B.E                        5.0  cloud server management  209921.824869
47  neuromorphic  24.0      F           M.E                        1.0  cloud server management   18088.934903
48          palm  22.0      F           B.E                        1.0              programming   18517.796382
49          palm  28.0      M           B.E                        5.0      predictive analysis  172093.709666
50          palm  30.0      F           M.E                        4.0  cloud server management  109038.291471
51          palm  35.0      M           M.E                        9.0      predictive analysis  316267.898598
52          palm  29.0      F           M.E                        5.0  cloud server management  177746.396982
53          palm  27.0      F           B.E                        5.0      predictive analysis  191753.644923
54          palm  26.0      M           B.E                        5.0  cloud server management  203870.644241
55          palm  24.0      F           M.E                        1.0  cloud server management   12037.754276
56      penguin   22.0      F           B.E                        1.0              programming   12466.615754
57      penguin   28.0      M           B.E                        5.0      predictive analysis  166042.529038
58      penguin   30.0      F           M.E                        4.0  cloud server management  102987.110844
59      penguin   35.0      M           M.E                        9.0      predictive analysis  310216.717970
60      penguin   29.0      F           M.E                        5.0  cloud server management  171695.216355
61      penguin   27.0      F           B.E                        5.0      predictive analysis  185702.464296
62      penguin   26.0      M           B.E                        5.0  cloud server management  197819.463614
63      penguin   24.0      F           M.E                        1.0  cloud server management    5986.573648

# Validation.csv - Save

In [722]:
allen3.to_csv('Validation.csv')